Revit 2026 API

# RailingGetPath Method

---

Gets the railing path.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Curve> GetPath()
```
```vb
Public Function GetPath As IList(Of Curve)
```
```cpp
public:
IList<Curve^>^ GetPath()
```
```fsharp
member GetPath : unit -> IList<Curve>
```

#### Return Value

IListCurve The curve array of the railing path.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The railing has incorrect internal data. |

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace